In [348]:
%load_ext sql
%sql sqlite:///lab4.db3

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

'Connected: @lab4.db3'

# Q1: A is a superkey for a relation T (A, B, C, D).

In [349]:
# TABLE THAT HOLDS THE CONDITION (A IS A SUPERKEY)

In [350]:
%%sql
CREATE TABLE T (
    A int PRIMARY KEY,
    B int,
    C int,
    D int
);
INSERT INTO T VALUES (1,2,3,4);
INSERT INTO T VALUES (2,3,3,4);
INSERT INTO T VALUES (3,5,3,4);
INSERT INTO T VALUES (4,4,3,4);
INSERT INTO T VALUES (5,3,3,4);

   sqlite:///lab2.db3
 * sqlite:///lab4.db3
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [351]:
# TABLE THAT FAILS THE CONDITION (A IS NOT A SUPERKEY)

In [352]:
%%sql
CREATE TABLE T2 (
    A2 int,
    B2 int,
    C2 int,
    D2 int
);
INSERT INTO T2 VALUES (1,2,3,4);
INSERT INTO T2 VALUES (2,3,3,4);
INSERT INTO T2 VALUES (1,5,3,4);
INSERT INTO T2 VALUES (4,4,3,4);
INSERT INTO T2 VALUES (1,3,3,4);

   sqlite:///lab2.db3
 * sqlite:///lab4.db3
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [353]:
# COUNT THE VALUE OF A
# IF THE VALUE OF A DOES NOT REPEAT IT IS A SUPERKEY
# THIS CODE IS FOR THE TABLE THAT HOLDS THE CONDITION

In [354]:
%%sql
SELECT A, COUNT(A) 
FROM T 
GROUP BY A ORDER BY A;

   sqlite:///lab2.db3
 * sqlite:///lab4.db3
Done.

[(1, 1), (2, 1), (3, 1), (4, 1), (5, 1)]

In [355]:
# COUNT THE VALUE OF A
# IF THE VALUE OF A DOES REPEATS IT IS NOT A SUPERKEY
# THIS CODE IS FOR THE TABLE THAT FAILS THE CONDITION

In [356]:
%%sql
SELECT A2, COUNT(A2) 
FROM T2
GROUP BY A2 ORDER BY A2

   sqlite:///lab2.db3
 * sqlite:///lab4.db3
Done.

[(1, 3), (2, 1), (4, 1)]

In [357]:
# RETURNS TRUE WHEN A IS A SUPERKEY
# A IS A SUPERKEY WHEN IT IS UNIQUE / DOES NOT REPEAT

In [358]:
%%sql
SELECT
      CASE WHEN EXISTS 
      (
            SELECT * FROM T WHERE 1
      )
      THEN 'TRUE'
      ELSE 'FALSE'
   END

   sqlite:///lab2.db3
 * sqlite:///lab4.db3
Done.

[('TRUE',)]

# Q2: The combinations of two attributes in the relation T (A, B, C, D) are each keys.

In [359]:
# T1 -> AB, T2 -> CD

In [360]:
# TABLE THAT HOLDS THE CONDITION FROM Q2

In [361]:
%%sql
drop table if exists T1;
CREATE TABLE T1(
    A int PRIMARY KEY,
    B int
);
INSERT INTO T1 VALUES (1,2);
INSERT INTO T1 VALUES (2,8);
INSERT INTO T1 VALUES (3,6);
INSERT INTO T1 VALUES (4,4);
INSERT INTO T1 VALUES (5,10);

drop table if exists T2;
CREATE TABLE T2(
    C int PRIMARY KEY,
    D int
);
INSERT INTO T2 VALUES (1,2);
INSERT INTO T2 VALUES (2,8);
INSERT INTO T2 VALUES (3,6);
INSERT INTO T2 VALUES (4,4);
INSERT INTO T2 VALUES (5,10);

   sqlite:///lab2.db3
 * sqlite:///lab4.db3
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [362]:
# T1 -> AB, T2 -> CD
# THIS CODE IS FOR THE TABLE THAT HOLDS THE CONDITION

In [363]:
%%sql
SELECT * 
FROM T1 
WHERE A IN ( SELECT C 
             FROM T2 ) AND B IN ( SELECT D 
                                  FROM T2 );

   sqlite:///lab2.db3
 * sqlite:///lab4.db3
Done.

[(1, 2), (2, 8), (3, 6), (4, 4), (5, 10)]

In [364]:
# TABLE THAT FAILS THE CONDITION FROM Q2

In [365]:
%%sql
drop table if exists T1;
CREATE TABLE T1(
    A int,
    B int
);
INSERT INTO T1 VALUES (1,2);
INSERT INTO T1 VALUES (2,8);
INSERT INTO T1 VALUES (3,6);
INSERT INTO T1 VALUES (4,4);
INSERT INTO T1 VALUES (5,10);

drop table if exists T2;
CREATE TABLE T2(
    C int,
    D int
);
INSERT INTO T2 VALUES (6,2);
INSERT INTO T2 VALUES (7,8);
INSERT INTO T2 VALUES (8,6);
INSERT INTO T2 VALUES (9,4);
INSERT INTO T2 VALUES (10,10);

   sqlite:///lab2.db3
 * sqlite:///lab4.db3
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [366]:
# THIS CODE IS FOR THE TABLE THAT FAILS THE CONDITION

In [367]:
%%sql
SELECT * 
FROM T1 
WHERE A IN ( SELECT C 
             FROM T2 ) AND B IN ( SELECT D 
                                  FROM T2 );

   sqlite:///lab2.db3
 * sqlite:///lab4.db3
Done.

[]

# Q3: Consider three tables Sailors(sid, sname, rating, age), Reserves(sid, bid, sname, bname, date) and Boats(bid, bname, color); Check for a TGD between Sailors and Reserves.

In [368]:
# CREATE TABLES FOR SAILORS, RESERVES, AND BOATS
# CONDITION HOLDS

In [369]:
%%sql

CREATE TABLE sailors(
    sid int primary key,
    sname varchar(50),
    rating int,
    Age int
);
INSERT INTO sailors VALUES(1, “ABC”, 5, 20);
INSERT INTO sailors VALUES(2, “FGHJ”, 5, 20);
INSERT INTO sailors VALUES(3, “TYU”, 5, 20);
INSERT INTO sailors VALUES(4, “DMN”, 5, 20);
INSERT INTO sailors VALUES(5, “WQE”, 5, 20);

CREATE TABLE Reserves (
    sid int,
    bid int,
    sname varchar(50),
    bname varchar(50),
    Date date,
    primary key(sid,bid)
);
INSERT INTO Reserves VALUES (1, 1, “ABC”, “KLJL”, “29-06-2021”);
INSERT INTO Reserves VALUES (2, 2, “FGHJ”, “SDHF”, “29-06-2021”);
INSERT INTO Reserves VALUES (3, 3, “TYU”, “CSKJ”, “29-06-2021”);
INSERT INTO Reserves VALUES (4, 4, “DMN”, “WNCI”, “29-06-2021”);
INSERT INTO Reserves VALUES (5, 5, “WQE”, “JKCB”, “29-06-2021”);

CREATE TABLE Boats(
    bid int primary key,
    bname varchar(50),
    color varchar(50)
);

   sqlite:///lab2.db3
 * sqlite:///lab4.db3
Done.
(sqlite3.OperationalError) no such column: “ABC”
[SQL: INSERT INTO sailors VALUES(1, “ABC”, 5, 20);]
(Background on this error at: http://sqlalche.me/e/13/e3q8)

In [370]:
%%sql
SELECT sid 
FROM Sailors 
WHERE sid IN ( SELECT distinct sid 
               FROM Reserves )

   sqlite:///lab2.db3
 * sqlite:///lab4.db3
(sqlite3.OperationalError) no such table: Reserves
[SQL: SELECT sid
FROM Sailors
WHERE sid IN ( SELECT distinct sid
               FROM Reserves )]
(Background on this error at: http://sqlalche.me/e/13/e3q8)

In [371]:
# CREATE TABLES FOR SAILORS AND RESERVES
# CONDITION FAILS

In [372]:
%%sql
drop table if exists sailors;
CREATE TABLE sailors(
    sid int,
    sname varchar(50),
    rating int,
    Age int
);
INSERT INTO sailors VALUES(1, “ABC”, 5, 20);
INSERT INTO sailors VALUES(2, “FGHJ”, 5, 20);
INSERT INTO sailors VALUES(3, “TYU”, 5, 20);
INSERT INTO sailors VALUES(1, “DMN”, 5, 20);
INSERT INTO sailors VALUES(5, “WQE”, 5, 20);

drop table if exists Reserves;
CREATE TABLE Reserves (
    sid int,
    bid int,
    sname varchar(50),
    bname varchar(50),
    Date date
);
INSERT INTO Reserves VALUES (1, 1, “ABC”, “KLJL”, “29-06-2021”);
INSERT INTO Reserves VALUES (2, 2, “FGHJ”, “SDHF”, “29-06-2021”);
INSERT INTO Reserves VALUES (3, 3, “TYU”, “CSKJ”, “29-06-2021”);
INSERT INTO Reserves VALUES (1, 1, “DMN”, “WNCI”, “29-06-2021”);
INSERT INTO Reserves VALUES (5, 5, “WQE”, “JKCB”, “29-06-2021”);

   sqlite:///lab2.db3
 * sqlite:///lab4.db3
Done.
Done.
(sqlite3.OperationalError) no such column: “ABC”
[SQL: INSERT INTO sailors VALUES(1, “ABC”, 5, 20);]
(Background on this error at: http://sqlalche.me/e/13/e3q8)

In [373]:
%%sql
SELECT sid 
FROM Sailors 
WHERE sid IN ( SELECT distinct sid 
               FROM Reserves )

   sqlite:///lab2.db3
 * sqlite:///lab4.db3
(sqlite3.OperationalError) no such table: Reserves
[SQL: SELECT sid
FROM Sailors
WHERE sid IN ( SELECT distinct sid
               FROM Reserves )]
(Background on this error at: http://sqlalche.me/e/13/e3q8)

# Q4: To simply the problem, we assume R = {A, B, C, D, E}, X = {A, B, C}, Y = {C, D, E}.

In [374]:
# CREATE TABLE R, X, AND Y

In [375]:
%%sql
CREATE TABLE R (
    A int PRIAMRY KEY,
    B int,
    C int,
    D int,
    E int
);
INSERT INTO R VALUES (1, 2, 3, 4, 5);
INSERT INTO R VALUES (2, 7, 3, 4, 2);
INSERT INTO R VALUES (3, 8, 3, 4, 3);
INSERT INTO R VALUES (4, 6, 3, 4, 4);
INSERT INTO R VALUES (5, 5, 9, 10, 2);

CREATE TABLE X (
    A int PRIAMRY KEY,
    B int,
    C int
);
INSERT INTO X VALUES (1, 2, 3);
INSERT INTO X VALUES (2, 7, 3);
INSERT INTO X VALUES (3, 8, 3);
INSERT INTO X VALUES (4, 6, 3);
INSERT INTO X VALUES (5, 5, 9);

CREATE TABLE Y (
    C int PRIAMRY KEY,
    D int,
    E int
);
INSERT INTO Y VALUES (3, 4, 5);
INSERT INTO Y VALUES (3, 4, 2);
INSERT INTO Y VALUES (3, 4, 3);
INSERT INTO Y VALUES (3, 4, 4);
INSERT INTO Y VALUES (9, 10, 2);

   sqlite:///lab2.db3
 * sqlite:///lab4.db3
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [376]:
%%sql
SELECT A, B, C 
FROM R 
WHERE EXISTS ( SELECT * 
               FROM X JOIN Y ON X.C = Y.C );

   sqlite:///lab2.db3
 * sqlite:///lab4.db3
Done.

[(1, 2, 3), (2, 7, 3), (3, 8, 3), (4, 6, 3), (5, 5, 9)]